In [4]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [2]:
# Series是一种类似于一维数组的对象
# 由一组数据(NumPy数据类型)以及一组与之相关的数据标签组成

# exp

obj = pd.Series([4,7,-5,3])

In [3]:
# Series的字符串表现形式为：索引在左边,值在右边。
# 由于没有为数据指定索引,会自动创建一个从0到N-1的整数型索引

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
# 可以用过Series的values和index属性获取其数组表示形式和索引对象

obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj.value_counts

<bound method IndexOpsMixin.value_counts of 0    4
1    7
2   -5
3    3
dtype: int64>

In [8]:
# 通常,我们希望所创建的Series带有一个可以对各个数据点进行标记的索引

obj2 = pd.Series([4,7,5,-3], index=['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a    5
c   -3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [12]:
# 可以通过索引的方式获取Series中的单个或一组值

obj2['a']

5

In [14]:
obj2[['c','a','d']] # 如果索引不存在的索引值,则会Warning并给出NaN

c   -3
a    5
d    4
dtype: int64

In [15]:
# 可以使用NumPy函数或者类NumPy运算
# 会保留索引值的链接

obj2[obj2 > 0]

d    4
b    7
a    5
dtype: int64

In [16]:
obj2 * 2

d     8
b    14
a    10
c    -6
dtype: int64

In [19]:
np.exp(obj2)

d      54.598150
b    1096.633158
a     148.413159
c       0.049787
dtype: float64

In [20]:
# 可以将Series看成是一个定长的有序字典

'b' in obj2

True

In [21]:
'f' in obj2

False

In [22]:
'e ' in obj2

False

In [23]:
# 可以用过Python字典直接创建Series

sdata = {'Ohio': 35000,'Texas':71000,'Oregon':16000,'Utah':5000}
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [25]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [27]:
states = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata,index = states)

obj4  #NaN表示缺失数据

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [28]:
# pandas的 isnull 和 notnul 函数可用于检测缺失数据
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [30]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [32]:
# Series最重要的一个功能,它会根据运算的索引标签自动对齐数据

obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [33]:
# Series的索引可以通过赋值的方式就地修改

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [34]:
obj.index = ['B','S','J','R']

In [35]:
obj

B    4
S    7
J   -5
R    3
dtype: int64

In [36]:
#######

In [4]:
# DataFrame 是一个表格型的数据结构
# DataFrame的构造方法
# 直接传入一个由等长列表或NumPy数组组成的字典

data = {'state' : ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}

frame = pd.DataFrame(data)

In [38]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [39]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [5]:
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],index=['o','t','th','f','fi','s'])
frame2

    year   state  pop debt
o   2000    Ohio  1.5  NaN
t   2001    Ohio  1.7  NaN
th  2002    Ohio  3.6  NaN
f   2001  Nevada  2.4  NaN
fi  2002  Nevada  2.9  NaN
s   2003  Nevada  3.2  NaN

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2['state']

o       Ohio
t       Ohio
th      Ohio
f     Nevada
fi    Nevada
s     Nevada
Name: state, dtype: object

In [6]:
frame2['debt'] = 16.5
frame2

    year   state  pop  debt
o   2000    Ohio  1.5  16.5
t   2001    Ohio  1.7  16.5
th  2002    Ohio  3.6  16.5
f   2001  Nevada  2.4  16.5
fi  2002  Nevada  2.9  16.5
s   2003  Nevada  3.2  16.5

In [7]:
frame2['eastern'] = frame2.state == 'Ohio'

In [8]:
frame2

    year   state  pop  debt  eastern
o   2000    Ohio  1.5  16.5     True
t   2001    Ohio  1.7  16.5     True
th  2002    Ohio  3.6  16.5     True
f   2001  Nevada  2.4  16.5    False
fi  2002  Nevada  2.9  16.5    False
s   2003  Nevada  3.2  16.5    False

In [9]:
# 可以使用del方法删除列
del frame2['eastern']
frame2

    year   state  pop  debt
o   2000    Ohio  1.5  16.5
t   2001    Ohio  1.7  16.5
th  2002    Ohio  3.6  16.5
f   2001  Nevada  2.4  16.5
fi  2002  Nevada  2.9  16.5
s   2003  Nevada  3.2  16.5

In [10]:
##
# 通过索引方式返回的列只是相应数据的视图而已，并不是副本。因此,对返回的Series所做的任何
# 地修改将全部反映到源DataFrame上。通过Series的copy方法即可指定复制列

In [11]:
# 另一种常见的数据形式是嵌套字典

pop = {'Nevada' :{2001:2.4,2002:2.9},
      'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [12]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [13]:
# 可以使用类似NumPy数组的方法,对DataFrame进行转置
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [14]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [5]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
                       columns=['one', 'two', 'three', 'four'])

In [6]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [7]:
data.drop('two',axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [8]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [10]:
data.drop('two',axis=1,inplace=True)

In [11]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [13]:
obj = pd.Series(np.arange(4,10),index=['a','b','c','d','e','f'])

In [14]:
obj

a    4
b    5
c    6
d    7
e    8
f    9
dtype: int32

In [15]:
obj[2:5]

c    6
d    7
e    8
dtype: int32

In [16]:
obj[[1,3]]

b    5
d    7
dtype: int32

In [18]:
obj['b':'e']  # 利用标签的切片运算与普通的切片运算不同,其末端是包含的

b    5
c    6
d    7
e    8
dtype: int32

In [19]:
  frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                      index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [20]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [21]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [22]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [25]:
obj = pd.Series([4,7,-3,2])

In [26]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [27]:
obj.sort_index()

0    4
1    7
2   -3
3    2
dtype: int64

In [28]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [29]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1],'c':[-3,2,1,10]})
frame

   b  a   c
0  4  0  -3
1  7  1   2
2 -3  0   1
3  2  1  10

In [31]:
frame.sort_values(by = ['b','c'])

   b  a   c
2 -3  0   1
3  2  1  10
0  4  0  -3
1  7  1   2

In [32]:
# rank方法
# 重复的元素取了均值 ,如 4 是 第4小和第5小的元素,所以取了4.5
obj = pd.Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [33]:
# 可以根据值在原数据中出现的顺序给出排名
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [34]:
frame = pd.DataFrame({'b' : [4.3,7,-3,2], 'a':[0,1,0,1], 'c' :[-2,5,8,-2.5]})

In [35]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [36]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [42]:
import pandas_datareader.data as web

In [ ]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})